import math

print("\n\n ______________________________________________________")
print("|васпривевтствует antenna adjuster войти <Y>es or <N>o|")
print("|_____________________________________________________|")
yes = input('')
while yes != 'Y':
     print("приходите ещё")
     yes = input('')
if yes == 'N':
  print("ctrl+c для выхода")
print("используйте только цифры и точки")
while 0 == 0 :
 print("Введите широту исходной точки:")
 y = float(input())
 print("Введите долготу исходной точки:")
 x = float(input())
 print("Введите широту точки азимут которой надо найти:")
 y1 = float(input())
 print("Введите долготу точки азимут которой надо найти:")
 x1 = float(input())
 if y1 == y:
    print("Искомый азимут в градусах:")
    print(0)
    print("\n\n ___________________________________________")
    print("| Для завершения программы нажсимте ctrl+C  |")
    print("|___________________________________________|\n\n") 
    continue;
 ax = math.atan((x1 - x)/(y1 - y))
 print("Искомый азимут в градусах:")
 print(ax*180/3.1415926535897932384626433832795)
 print("\n\n ___________________________________________")
 print("| Для завершения программы нажсимте ctrl+C  |")
 print("|___________________________________________|")

 print(" __________________________________________________________________ ")
 print("| antenna adjuster_  by keyj    _                                 |")
 print("| if you want english localisation my post jeykeyrobokey@gmail.com|")
 print("|_________________________________________________________________|\n\n")




